/****************************************************************************
** delay.h
**
** Copyright (c) Siargo Ltd. 2020
** All Rights Reserved.
**
** BY HYY
**
** delay.c的宏定义和声明
**
**
** 文件历史
** 2020-04-27 韩堉元创建
*****************************************************************************/
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __delay_H
#define __delay_H
#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "GlobeDef.h"

/* 宏定义 ----------------------------------------------------------------*/ 

/* 变量声明 ----------------------------------------------------------------*/ 


/* 函数声明 ----------------------------------------------------------------*/ 
void delay_ms(u16 nms);
void delay_us(u32 nus);
void delay_init(u8 SYSCLK);


#ifdef __cplusplus
}
#endif
#endif /*__ delay_H */

/**
  * @}
  */

/**
  * @}
  */

/************************ Copyright (c) Siargo Ltd. 2020 *****END OF FILE****/
